# 凡是有志于在美食节大放光彩的学生，都开始积极地准备了。
# 有些同学积极参与，不仅完成了本小组的准备工作，而且还帮助其他小组完成准备工作。
# 鉴于此，学校决定进行统计，凡是参与多个小组的学生，可以获得更多的积分。
# 最后将积分用字典的形式表示出来。
students = [
    '小楷', '小美', '志豪', '秀玉', '叶真', '维佳',
    '陈伟', '秋秋', '文洁', '希希', '雯雯', '小雨',
    '晗晗', '小冉', '鑫鑫', '紫萱', '陈硕', '青松',
    '小鹏', '东皓', '泽敏', '飞龙', '慧芳', '志军',
    '陈健', '吉娜', '小鹿', '韩牧', '王瑾', '诗琪',
    '浩然', '嘉嘉', '芸菲', '书豪', '月月', '文英',
    '荣凯', '秀秀', '丹丹', '冰冰', '旭亮', '天明'
]
# students.remove('旭亮')
# students.pop(40)
del students[40]
# print(students)

your_name = 'a'
# students.append(your_name)
students.insert(0, your_name)

# print(students)

members_list = {
    '披萨铺': ['小楷', '小美', '天明', '荣凯', '小雨'],
    '烧烤铺': ['陈健', '吉娜', '小鹿', '韩牧', '王瑾', '诗琪', '浩然', '嘉嘉', '芸菲', '书豪', '月月'],
    '糕点铺': ['小楷', '小美', '丹丹', '冰冰', '文英', '天明'],
    '糖水铺': ['小美', '东皓', '飞龙', '月月'],
    '小吃铺': ['小雨', '晗晗', '小冉', '鑫鑫', '紫萱', '陈硕'],
    '零食铺': ['文英', '荣凯', '秀秀', '丹丹', '冰冰'],
    'DIY工厂': ['小楷', '陈伟', '秋秋', '文洁', '何鲜', '雯雯', '小雨']
}
dic = {}
for i in students:
    count = 0
    for j in members_list:
        if i in members_list[j]:
            count += 1
    dic[i] = count
print(dic)






